<!-- eslint-disable max-len -->
<template>
  <div class="hardware">
    <page-heading>Аппаратное обеспечение</page-heading>
    <page-section heading="Что такое аппаратное обеспечение?"/>
    <page-text>Аппара́тное обеспече́ние, аппаратные средства, компьютерные комплектующие, «железо», (англ. hardware) — электронные и механические части вычислительного устройства, входящие в состав системы или сети, исключая программное обеспечение и данные (информацию, которую вычислительная система хранит и обрабатывает). Аппаратное обеспечение включает: компьютеры и логические устройства, внешние устройства и диагностическую аппаратуру, энергетическое оборудование, батареи и аккумуляторы. К аппаратному обеспечению относятся устройства, образующие конфигурацию компьютера.</page-text>
    <page-text>Различают внутренние и внешние устройства. Согласование между отдельными узлами и блоками выполняется с помощью аппаратно-логических устройств, называемых аппаратными интерфейсами; стандарты на аппаратные интерфейсы называют протоколами. Персональный компьютер — универсальная техническая система, конфигурацию которой можно изменять по мере необходимости.</page-text>
    <page-section heading="Компьютер"/>
    <page-text>Аппаратное обеспечение вычислительных систем — обобщённое название оборудования, на котором работают компьютеры и сети компьютеров.</page-text>
    <page-text>К аппаратному обеспечению обычно относят:</page-text>
    <page-list :list-items="[
      'центральный процессор (процессоры)',
      'оперативную память',
      'системную логику',
      'периферийные устройства',
      'сетевое оборудование'
    ]"/>
    <page-text>Некоторая часть задач, выполняемая аппаратным обеспечением может быть выполнена частично или полностью с помощью программной эмуляции, например, в персональных компьютерах часто используется программная реализация протоколов связи модемов, программная эмуляция функций отрисовки 3D изображений. Обычно перенос выполняемой задачи из аппаратной части в программную уменьшает стоимость оборудования, но увеличивает нагрузку на центральный процессор.</page-text>
    <page-text>В случае существенной нагрузки на процессор определённого рода задачами, для повышения производительности производят обратную операцию: аппаратно реализуют часть алгоритма, уменьшая участие процессора в выполнении алгоритма.</page-text>
    <page-text>Примеры аппаратной реализации алгоритмов, которые могли бы быть реализованы программно:</page-text>
    <page-list :list-items="[
      '3D графика',
      'DMA-режим работы IDE устройств',
      'FIFO-буффер у COM-портов',
      'Физический процессор для обсчёта поведения объектов в компьютерных играх',
      'Математический сопроцессор, ускоряющий операции с плавающей запятой (в современных процессорах интегрирован)',
      'Функции файрвола'
    ]"
    />
    <page-subheading>Персональный компьютер</page-subheading>
    <page-text>Обычный персональный компьютер состоит из системного блока, состоящего из шасси и периферийных устройств.</page-text>
    <page-text>В состав системного блока входят:</page-text>
    <page-list :list-items="[
      {
        text: 'материнская плата с припаянными или установленными на ней:',
        children: [
          'Чипсет — взаимосвязанный набор микросхем, логика которого в наибольшей степени определяет то, каковы прочие элементы компьютера.',
          'центральный процессор',
          'BIOS — программное обеспечение в ПЗУ материнской платы.',
          'кулер охлаждения процессора как основного тепловыделяющего элемента современного компьютера.',
          'оперативная память и кэш',
          'слоты расширения шин — PCI, PCI-E, USB, FireWire, AGP (устарела), ISA (устарела), EISA (устарела)',
          'контроллеры устройств — хранения: IDE, SCSI, SATA, SAS или других типов, находящиеся непосредственно на материнской плате (встроенные) либо на платах расширения.',
          'видеоконтроллер (встроенный или в виде отдельной платы), передающий сигнал на монитор',
          'звуковой контроллер',
          'сетевой интерфейс (сетевая плата)'
        ]
      },
      'блок питания',
      'система охлаждения — дополнительные элементы охлаждения (вентиляторы, механические элементы, части водяной системы охлаждения), необходимые при установке блоков, имеющих повышенное тепловыделение (видеокарт, вычислительных сопроцессоров).'
    ]"/>
    <page-section heading="Архитектура"/>
    <page-text>Под архитектурой аппаратного обеспечения компьютера понимаются внутренние компоненты компьютера и подключенные к нему устройства ввода (как компьютерная мышь и клавиатура) и устройства вывода (монитор). Внутренние компоненты компьютера вместе представляют собой вычислительное и управляющее устройство, объединённое шиной. Более распространены обозначения процессор, оперативная память и жесткий диск. Шина соединяет отдельные компоненты в сложную систему, так как без шины разрозненные детали не смогли бы функционировать. Процессор или ЦПУ определяет основную скорость работы компьютера. Требования к тактированию ЦПУ и собственной мощности процессора постоянно увеличиваются, так как и предъявляемые к технике требования тоже растут. Программное обеспечение, которое позже устанавливается на компьютер, требует все большей мощности процессора.</page-text>
    <page-text>Термин архитектура распространяется на устройство комплектной системы, так как отдельные компоненты должны быть друг с другом согласованы, чтобы гарантировать бесперебойное протекание процесса. В противном случае в будущем это приведёт к проблемам с компьютером. Если элемент не подходит к другим компонентам, то они так же не могут потреблять полную мощность. Отдельные составные блоки, такие, как процессор, оперативная память или шина, при сборке корпуса должны составлять одно целое. Иначе подключенное к процессору программное обеспечение не сможет выполнять свои задачи в полной мере и обращение с компьютером будет усложнено.</page-text>
  </div>
</template>

<script>
import PageSubheading from '../components/PageSubheading.vue';
import PageList from '../components/PageList.vue';
import PageText from '../components/PageText.vue';
import PageSection from '../components/PageSection.vue';
import PageHeading from '../components/PageHeading.vue';

export default {
  name: 'Hardware',
  components: {
    PageSection,
    PageHeading,
    PageText,
    PageList,
    PageSubheading,
  },
};
</script>

<style scoped lang="scss">

</style>
