<!-- eslint-disable max-len -->
<template>
  <div class="ram">
    <page-heading>Оперативная память</page-heading>
    <page-text>Операти́вная па́мять (англ. Random Access Memory, RAM — память с произвольным доступом) — в большинстве случаев энергозависимая часть системы компьютерной памяти, в которой во время работы компьютера хранится выполняемый машинный код (программы), а также входные, выходные и промежуточные данные, обрабатываемые процессором. Оперативное запоминающее устройство (ОЗУ) — техническое устройство, реализующее функции оперативной памяти. ОЗУ может изготавливаться как отдельный внешний модуль или располагаться на одном кристалле с процессором, например, в однокристальных ЭВМ или однокристальных микроконтроллерах.</page-text>
    <page-text>Обмен данными между процессором и оперативной памятью производится как непосредственно, так и через сверхбыструю память нулевого уровня либо, при наличии аппаратного кэша процессора, — через кэш.</page-text>
    <page-text>Содержащиеся в полупроводниковой оперативной памяти данные доступны и сохраняются только тогда, когда на модули памяти подаётся напряжение. Выключение питания оперативной памяти, даже кратковременное, приводит к потере хранимой информации.</page-text>
    <page-text>Энергосберегающие режимы работы материнской платы компьютера позволяют переводить его в режим сна, что значительно сокращает уровень потребления компьютером электроэнергии. В режиме гибернации питание ОЗУ отключается. В этом случае для сохранения содержимого ОЗУ операционная система перед отключением питания записывает содержимое ОЗУ на устройство постоянного хранения данных (на жёсткий диск или твердотельный накопитель). Например, в Windows XP содержимое памяти сохраняется в файл hiberfil.sys, в системах семейства Unix — на специальный swap-раздел.</page-text>
    <page-text>В общем случае ОЗУ содержит программы и данные операционной системы и запущенные прикладные программы пользователя и данные этих программ, поэтому от объёма оперативной памяти зависит количество задач, которые одновременно может выполнять компьютер под управлением операционной системы.</page-text>
    <page-section heading="ОЗУ современных компьютеров"/>
    <page-text>ОЗУ большинства современных компьютеров представляет собой модули динамической памяти, содержащие полупроводниковые интегральные схемы, организованные по принципу устройств с произвольным доступом. Память динамического типа дешевле, чем статического, и её плотность выше, что позволяет на той же площади кремниевого кристалла разместить больше ячеек памяти, но при этом её быстродействие ниже. Статическая память, наоборот, более быстрая память, но она и дороже. В связи с этим основную оперативную память строят на модулях динамической памяти, а память статического типа используется для построения кэш-памяти внутри микропроцессора.</page-text>
    <page-subheading>Память динамического типа</page-subheading>
    <page-text>Экономичный вид памяти. Для хранения разряда (бита или трита) используется схема, состоящая из одного конденсатора и одного транзистора (в некоторых вариантах два конденсатора). Такой вид памяти, во-первых, дешевле (один конденсатор и один транзистор на 1 бит дешевле нескольких транзисторов входящих в триггер), и, во-вторых, занимает меньшую площадь на кристалле, там, где в SRAM размещается один триггер, хранящий 1 бит, можно разместить несколько конденсаторов и транзисторов для хранения нескольких бит.</page-text>
    <page-text>DRAM имеет определённые недостатки. Во-первых, работает медленнее, поскольку, если в SRAM изменение управляющего напряжения на входе триггера сразу очень быстро изменяет его состояние, то для того, чтобы изменить состояние конденсатора, его нужно зарядить или разрядить. Перезаряд конденсатора гораздо более длителен (в 10 и более раз), чем переключение триггера, даже если ёмкость конденсатора очень мала. Второй существенный недостаток — конденсаторы со временем разряжаются. Причём разряжаются они тем быстрее, чем меньше их электрическая ёмкость и больше ток утечки, в основном, это утечка через ключ.</page-text>
    <page-text>Именно из-за того, что заряд конденсатора постепенно уменьшается во времени, память на конденсаторах получила своё название DRAM — динамическая память. Поэтому, дабы не потерять содержимое памяти, величина заряда конденсаторов периодически восстанавливается («регенерируется») через определённое время, называемое циклом регенерации, для современных микросхем памяти это время не должно превышать 2 мс. Для регенерации в современных микросхемах достаточно выполнить циклограмму чтения по всем строкам запоминающей матрицы. Процедуру регенерации выполняет процессор или контроллер памяти. Так как для регенерации памяти периодически приостанавливается обращение к памяти, это снижает среднюю скорость обмена с этим видом ОЗУ.</page-text>
    <page-subheading>Память статического типа</page-subheading>
    <page-text>ОЗУ, которое не надо регенерировать, обычно схемотехнически выполненное в виде массива триггеров, называют статической памятью с произвольным доступом или просто статической памятью. Достоинство этого вида памяти — скорость. Поскольку триггеры являются соединением нескольких логических вентилей, а время задержки на вентиль очень мало, то и переключение состояния триггера происходит очень быстро. Данный вид памяти не лишён недостатков. Во-первых, группа транзисторов, входящих в состав триггера, обходится дороже, чем ячейка динамической памяти, даже если они изготавливаются групповым методом миллионами на одной кремниевой подложке. Кроме того, группа транзисторов, входящих в статический триггер занимает гораздо больше площади на кристалле, чем ячейка динамической памяти, поскольку триггер состоит минимум из 2 вентилей, в каждый вентиль входит по меньшей мере один транзистор, а ячейка динамической памяти — только из одного транзистора и одного конденсатора. Память статического типа используется для организации сверхбыстродействующего ОЗУ, обмен информацией с которым критичен для производительности системы.</page-text>
    <page-section heading="Логическая структура памяти в IBM PC"/>
    <page-text>В реальном режиме память делится на следующие участки:</page-text>
    <page-list :list-items="[
      'основная область памяти (англ. conventional memory),',
      'расширенная память (EMS),',
      'дополнительная память (XMS),',
      'Upper Memory Area (UMA),',
      'High Memory Area (HMA).'
    ]"/>
    <page-section heading="Как выглядит ОЗУ"/>
    <page-carousel :images="[
      'ram1.png',
      'ram2.png',
      'ram3.png',
    ]"/>
  </div>
</template>

<script>
import PageCarousel from '../components/PageCarousel.vue';
import PageList from '../components/PageList.vue';
import PageSubheading from '../components/PageSubheading.vue';
import PageSection from '../components/PageSection.vue';
import PageText from '../components/PageText.vue';
import PageHeading from '../components/PageHeading.vue';

export default {
  name: 'Ram',
  components: {
    PageHeading,
    PageText,
    PageSection,
    PageSubheading,
    PageList,
    PageCarousel,
  },
};
</script>

<style scoped lang="scss">

</style>
